apache/nuttx/arch/arm/src/common/stm32/stm32_fdcan_m3m4_v1.c
  caninfo("FDCAN%d enable: %d\n", priv->config->port, enable);

  /* Enable/disable the receive interrupts */

  regval = fdcan_getreg(priv, STM32_FDCAN_IE_OFFSET);

  if (enable)
    {
      regval |= priv->rxints | FDCAN_COMMON_INTS;
    }
  else
    {
      regval &= ~priv->rxints;
    }

  fdcan_putreg(priv, STM32_FDCAN_IE_OFFSET, regval);
}

/****************************************************************************
 * Name: fdcan_txint
 *
 * Description:
 *   Call to enable or disable TX interrupts.
 *
 * Input Parameters:
 *   dev - An instance of the "upper half" can driver state structure.
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void fdcan_txint(struct can_dev_s *dev, bool enable)
{
  struct stm32_fdcan_s *priv = dev->cd_priv;
  uint32_t              regval = 0;

  DEBUGASSERT(priv && priv->config);

  caninfo("FDCAN%d enable: %d\n", priv->config->port, enable);

  /* Enable/disable the receive interrupts */

  regval = fdcan_getreg(priv, STM32_FDCAN_IE_OFFSET);

  if (enable)
    {
      regval |= priv->txints | FDCAN_COMMON_INTS;
    }
  else
    {
      regval &= ~priv->txints;
    }

  fdcan_putreg(priv, STM32_FDCAN_IE_OFFSET, regval);
}

/****************************************************************************
 * Name: fdcan_ioctl
 *
 * Description:
 *   All ioctl calls will be routed through this method
 *
 * Input Parameters:
 *   dev - An instance of the "upper half" can driver state structure.
 *
 * Returned Value:
 *   Zero on success; a negated errno on failure
 *
 ****************************************************************************/

static int fdcan_ioctl(struct can_dev_s *dev, int cmd, unsigned long arg)
{
  struct stm32_fdcan_s *priv = NULL;
  int                   ret  = -ENOTTY;

  caninfo("cmd=%04x arg=%lu\n", cmd, arg);

  DEBUGASSERT(dev && dev->cd_priv);
  priv = dev->cd_priv;

  /* Handle the command */

  switch (cmd)
    {
      /* CANIOC_GET_BITTIMING:
       *   Description:    Return the current bit timing settings
       *   Argument:       A pointer to a write-able instance of struct
       *                   canioc_bittiming_s in which current bit timing
       *                   values will be returned.
       *   Returned Value: Zero (OK) is returned on success.  Otherwise -1
       *                   (ERROR) is returned with the errno variable set
       *                   to indicate the nature of the error.
       *   Dependencies:   None
       */

      case CANIOC_GET_BITTIMING:
        {
          struct canioc_bittiming_s *bt =
            (struct canioc_bittiming_s *)arg;
          uint32_t regval;
          uint32_t nbrp;

          DEBUGASSERT(bt != NULL);

#ifdef CONFIG_CAN_FD
          if (bt->type == CAN_BITTIMING_DATA)
            {
              regval        = fdcan_getreg(priv, STM32_FDCAN_DBTP_OFFSET);
              bt->bt_sjw   = ((regval & FDCAN_DBTP_DSJW_MASK) >>
                              FDCAN_DBTP_DSJW_SHIFT) + 1;
              bt->bt_tseg1 = ((regval & FDCAN_DBTP_DTSEG1_MASK) >>
                              FDCAN_DBTP_DTSEG1_SHIFT) + 1;
              bt->bt_tseg2 = ((regval & FDCAN_DBTP_DTSEG2_MASK) >>
                              FDCAN_DBTP_DTSEG2_SHIFT) + 1;

              nbrp          = ((regval & FDCAN_DBTP_DBRP_MASK) >>
                              FDCAN_DBTP_DBRP_SHIFT) + 1;
              bt->bt_baud   = STM32_FDCANCLK_FREQUENCY / nbrp /
                            (bt->bt_tseg1 + bt->bt_tseg2 + 1);
            }
          else
#endif
            {
              regval        = fdcan_getreg(priv, STM32_FDCAN_NBTP_OFFSET);
              bt->bt_sjw   = ((regval & FDCAN_NBTP_NSJW_MASK) >>
                              FDCAN_NBTP_NSJW_SHIFT) + 1;
              bt->bt_tseg1 = ((regval & FDCAN_NBTP_NTSEG1_MASK) >>
                              FDCAN_NBTP_NTSEG1_SHIFT) + 1;
              bt->bt_tseg2 = ((regval & FDCAN_NBTP_NTSEG2_MASK) >>
                              FDCAN_NBTP_NTSEG2_SHIFT) + 1;

              nbrp          = ((regval & FDCAN_NBTP_NBRP_MASK) >>
                              FDCAN_NBTP_NBRP_SHIFT) + 1;
              bt->bt_baud   = STM32_FDCANCLK_FREQUENCY / nbrp /
                            (bt->bt_tseg1 + bt->bt_tseg2 + 1);
            }

          ret = OK;
        }
        break;

      /* CANIOC_SET_BITTIMING:
       *   Description:    Set new current bit timing values
       *   Argument:       A pointer to a read-able instance of struct
       *                   canioc_bittiming_s in which the new bit timing
       *                   values are provided.
       *   Returned Value: Zero (OK) is returned on success.  Otherwise -1
       *                   (ERROR) is returned with the errno variable set
       *                   to indicate the nature of the error.
       *   Dependencies:   None
       *
       * REVISIT: There is probably a limitation here:  If there are
       * multiple threads trying to send CAN packets, when one of these
       * threads reconfigures the bitrate, the FDCAN hardware will be reset
       * and the context of operation will be lost.  Hence, this IOCTL can
       * only safely be executed in quiescent time periods.
       */

      case CANIOC_SET_BITTIMING:
        {
          const struct canioc_bittiming_s *bt =
            (const struct canioc_bittiming_s *)arg;
          uint32_t nbrp;
          uint32_t ntseg1;
          uint32_t ntseg2;
          uint32_t nsjw;
          uint32_t ie;
          uint8_t state;

          DEBUGASSERT(bt != NULL);
          DEBUGASSERT(bt->bt_baud > 0 &&
            bt->bt_baud < STM32_FDCANCLK_FREQUENCY);
          DEBUGASSERT(bt->bt_sjw > 0 && bt->bt_sjw <= 16);
          DEBUGASSERT(bt->bt_tseg1 > 1 && bt->bt_tseg1 <= 64);
          DEBUGASSERT(bt->bt_tseg2 > 0 && bt->bt_tseg2 <= 16);

          /* Extract bit timing data */

          ntseg1 = bt->bt_tseg1 - 1;
          ntseg2 = bt->bt_tseg2 - 1;
          nsjw   = bt->bt_sjw   - 1;

          nbrp = (uint32_t)
            (((float) STM32_FDCANCLK_FREQUENCY /
             ((float)(ntseg1 + ntseg2 + 3) * (float)bt->bt_baud)) - 1);

          /* Save the value of the new bit timing register */

#ifdef CONFIG_CAN_FD
          if (bt->type == CAN_BITTIMING_DATA)
            {
              priv->dbtp = FDCAN_NBTP_DBRP(nbrp) |
                           FDCAN_NBTP_DTSEG1(ntseg1) |
                           FDCAN_DBTP_DTSEG2(ntseg2) |
                           FDCAN_DBTP_DSJW(nsjw);
            }
          else
#endif
            {
              priv->nbtp = FDCAN_NBTP_NBRP(nbrp) |
                           FDCAN_NBTP_NTSEG1(ntseg1) |
                           FDCAN_NBTP_NTSEG2(ntseg2) |
                           FDCAN_NBTP_NSJW(nsjw);
            }

          /* We need to reset to instantiate the new timing.  Save
           * current state information so that recover to this
           * state.
           */

          ie    = fdcan_getreg(priv, STM32_FDCAN_IE_OFFSET);
          state = priv->state;

